ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
    ledc_channel_config_t ch_a = {
        .gpio_num   = PWMA_PIN,
        .speed_mode = LEDC_HIGH_SPEED_MODE,
        .channel    = LEDC_CHANNEL_0,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = PWM_DUTY_50,
        .hpoint     = 0,
    };
    ESP_ERROR_CHECK(ledc_channel_config(&ch_a));

    ledc_channel_config_t ch_b = {
        .gpio_num   = PWMB_PIN,
        .speed_mode = LEDC_HIGH_SPEED_MODE,
        .channel    = LEDC_CHANNEL_1,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = PWM_DUTY_50,
        .hpoint     = 0,
    };
    ESP_ERROR_CHECK(ledc_channel_config(&ch_b));
}

/* Set once in app_main(), read (not written) by uros_task() afterward - no
 * cross-task synchronization needed for this handle itself (it's immutable
 * after setup), unlike the encoder pulse counters which DO cross an
 * ISR/task boundary and need portENTER_CRITICAL. */
static i2c_master_dev_handle_t imu_dev = NULL;

/* One-shot diagnostic: probe every valid 7-bit address (1-126) and record
 * which ones ACK. TEMPORARY debugging aid for the 2026-08-20 imu_read_failed
 * investigation (wiring/power/continuity all confirmed OK by hand, so the
 * remaining question is literally "is anything answering, and at what
 * address" - AD0 tied high would put the MPU6050 at 0x69, not the 0x68
 * this firmware hardcodes). Fine to remove once the IMU is confirmed
 * working - not something to keep running on every boot forever. */
static void i2c_scan_bus(i2c_master_bus_handle_t bus_handle) {
    char *p = g_i2c_scan_result;
    char *end = g_i2c_scan_result + sizeof(g_i2c_scan_result);
    int found = 0;
    for (uint8_t addr = 1; addr < 127; addr++) {
        if (i2c_master_probe(bus_handle, addr, 30) == ESP_OK) {
            int n = snprintf(p, end - p, found ? ",%02X" : "%02X", addr);
            if (n > 0 && p + n < end) {
                p += n;
            }
            found++;
        }
    }
    if (!found) {
        snprintf(g_i2c_scan_result, sizeof(g_i2c_scan_result), "none");
    }
}

/* Bring up the I2C bus + MPU6050 device and wake it from sleep.
 * Deliberately NOT ESP_ERROR_CHECK'd end-to-end like setup_gpio/setup_pwm:
 * a bad/unplugged IMU should not crash-loop the whole robot and take the
 * already-proven motor/encoder/odom path down with it. imu_dev stays NULL
 * on any failure; imu_read_raw() checks that and no-ops. */
static void setup_imu(void) {
    /* MPU6050 needs some tens of ms after power-up before it reliably
     * answers on I2C (datasheet power-on-reset timing). setup_gpio()/
     * setup_pwm() above already burn a little time, but not reliably
     * enough to depend on - without this, a cold boot could race the
     * sensor and permanently disable IMU reads for that whole session
     * (see imu_dev = NULL below) even though nothing is actually wrong. */
    vTaskDelay(pdMS_TO_TICKS(50));

    i2c_master_bus_config_t bus_cfg = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = I2C_NUM_0,
        .scl_io_num = IMU_SCL_PIN,
        .sda_io_num = IMU_SDA_PIN,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    i2c_master_bus_handle_t bus_handle;
    if (i2c_new_master_bus(&bus_cfg, &bus_handle) != ESP_OK) {
        return;
    }

    i2c_scan_bus(bus_handle);

    /* 2026-08-20: was 400000 (Fast Mode). Real writes (the PWR_MGMT_1 wake
     * command below) were failing while i2c_master_probe() - a much lighter
     * transaction - still ACKed fine at the same address. Classic breadboard
     * symptom: internal ESP32 pull-ups + jumper wire capacitance can't
     * reliably hold Fast Mode timing even though the device is genuinely
     * present and wired correctly. Standard Mode (100kHz) is far more
     * tolerant of exactly this. */
    i2c_device_config_t dev_cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = MPU6050_I2C_ADDR,
        .scl_speed_hz = 100000,
    };
    if (i2c_master_bus_add_device(bus_handle, &dev_cfg, &imu_dev) != ESP_OK) {
        imu_dev = NULL;
        return;
    }

    /* Retried rather than one-shot: i2c_master_probe() above already
     * confirmed the device ACKs its address, so if this still fails outright
     * every time, address/wiring isn't the question anymore - only whether
     * a real (multi-byte) transaction can get through at all. Retrying
     * turns "always fails" vs. "succeeds on attempt N" into a diagnostic:
     * the latter points at a marginal/intermittent connection rather than
     * a clean broken/not-broken wiring fault. */
    uint8_t wake_cmd[2] = { MPU6050_REG_PWR_MGMT_1, 0x00 };
    bool wake_ok = false;
    for (int attempt = 1; attempt <= 5; attempt++) {
        if (i2c_master_transmit(imu_dev, wake_cmd, sizeof(wake_cmd),
                                 pdMS_TO_TICKS(100)) == ESP_OK) {
            g_imu_wake_attempts = attempt;
            wake_ok = true;
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(20));
    }
    if (!wake_ok) {
        g_imu_wake_attempts = -1;
        imu_dev = NULL;  /* wiring/address wrong - don't let later reads run */
    }
}

/* Burst-reads accel+temp+gyro (14 bytes from ACCEL_XOUT_H) and splits it
 * into the 6 raw int16 values callers actually want (temp bytes are read
 * and discarded - the sensor only supports reading this block contiguously,
 * there's no cheaper way to skip over temp mid-burst). Big-endian per
 * MPU6050's register layout (MSB byte first for every axis). */
#define IMU_MAX_CONSECUTIVE_FAILURES 5

/* Guards uros_task's control loop from a flaky/loose IMU wire: bounds each
 * stall tightly (a healthy MPU6050 answers in well under 1ms at 400kHz -
 * 5ms is already generous) AND gives up retrying after repeated failures
 * instead of eating that stall every single 100ms cycle forever. Matches
 * the same "don't let IMU trouble touch the proven motor/odom path"
 * philosophy as setup_imu()'s soft-fail. */
static bool imu_read_raw(int16_t *ax, int16_t *ay, int16_t *az,
                          int16_t *gx, int16_t *gy, int16_t *gz) {
    static uint8_t consecutive_failures = 0;

    if (imu_dev == NULL) {
        return false;
    }
    uint8_t reg = MPU6050_REG_ACCEL_XOUT_H;
    uint8_t data[IMU_READ_LEN];
    /* 2026-08-20: was 5ms. The wake-up write (a simpler transaction, no
     * repeated-start) succeeds on attempt 1 every time, but this combined
     * write+repeated-start+14-byte-read was failing 100% of the time at
     * 5ms - testing whether that's simply too tight for the more complex
     * transaction on this wiring, not a fully broken connection. */
    if (i2c_master_transmit_receive(imu_dev, &reg, 1, data, sizeof(data),
                                     pdMS_TO_TICKS(100)) != ESP_OK) {
        if (++consecutive_failures >= IMU_MAX_CONSECUTIVE_FAILURES) {
            imu_dev = NULL;  /* bus likely wedged - stop paying the stall */
        }
        return false;
    }
    consecutive_failures = 0;
    *ax = (int16_t)((data[0]  << 8) | data[1]);
    *ay = (int16_t)((data[2]  << 8) | data[3]);
    *az = (int16_t)((data[4]  << 8) | data[5]);
    /* data[6]/data[7] = temperature, unused here */
    *gx = (int16_t)((data[8]  << 8) | data[9]);
    *gy = (int16_t)((data[10] << 8) | data[11]);
    *gz = (int16_t)((data[12] << 8) | data[13]);
    return true;
}

