ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
/* UART0 is the same physical wire idf.py monitor uses for the console - see
 * the F5 note on ESP_LOGI above. Reused from the proven esp32/microros_hello
 * pin/transport setup (Week 1), not a new choice. */
static size_t uart_port = UART_NUM_0;

void app_main(void) {
    /* First thing, before anything else touches power/peripherals - see
     * g_reset_reason comment above for why this matters. */
    g_reset_reason = esp_reset_reason();

    setup_gpio();
    setup_pwm();
    setup_imu();

    /* Sets the electrical default (forward) before control_task starts
     * updating these live every cycle from the actual commanded direction
     * (see the signed_target_left/right block in control_task, fixed
     * 2026-08-26). PWM=0 from a stale/absent /cmd_vel (the safety default)
     * means the motors don't move regardless of what these say.
     *
     * FLIPPED 2026-08-11 (was AIN1=1,AIN2=0 / BIN1=1,BIN2=0): the front/back
     * half of the forward-direction redefinition — see the AIN1_PIN #define
     * comment above for the full reasoning. This reverses each wheel's
     * physical spin direction for the same PWM value, which combined with
     * the pin-routing swap above is what makes the robot's "forward" match
     * the camera's facing direction instead of the original mount
     * direction. */
    gpio_set_level(STBY_PIN, 1);   /* wake the TB6612FNG out of standby */
    gpio_set_level(AIN1_PIN, 0);
    gpio_set_level(AIN2_PIN, 1);
    gpio_set_level(BIN1_PIN, 0);
    gpio_set_level(BIN2_PIN, 1);

    rmw_uros_set_custom_transport(true, (void *)&uart_port,
        esp32_serial_open, esp32_serial_close,
        esp32_serial_write, esp32_serial_read);

    /* BUG FOUND 2026-07-27 (F5 first test): ESP_LOGI/ESP_LOGW in control_task
     * and the micro-ROS transport above both write to UART0 at the same
     * time - confirmed live as a burst of garbled characters in the monitor
     * output, at the same moment the micro-ROS agent never saw a valid
     * session-establish packet. The two streams were corrupting each other.
     * Once the transport is set, all console log output must stop - from
     * here on, debugging is via `ros2 topic echo` on the Jetson, not
     * idf.py monitor (see README F5 section). */
    esp_log_level_set("*", ESP_LOG_NONE);

    xTaskCreate(control_task, "control_task", 4096, NULL, 5, NULL);
    xTaskCreate(uros_task, "uros_task", 16000, NULL, 5, NULL);

    /* app_main returns here; both tasks keep running. */
}
